Desktop/santo_varal_store/app/controllers/simple_pages_controller.rb

  def landing_page
     @products = Product.limit(3)
---
SELECT "products".* FROM "products" LIMIT ?  [["LIMIT", 3]]