app/controllers/comments_controller.rb

  def create
    @product = Product.find(params[:product_id])
    @comment = @product.comments.new(comment_params)
    @comment.user = current_user
    @user = current_user

    respond_to do |format|
      if @comment.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["body", "I love this product!"], ["rating", 5], ["product_id", 1], ["created_at", "2019-09-27 15:20:30.466609"], ["updated_at", "2019-09-27 15:20:30.466609"]]