app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%%')
---
  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["product_id", 1], ["LIMIT", 7], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]
---
  def show
    @comments = @product.comments.order("created_at DESC").paginate(:page => params[:page], :per_page => 3)

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)
    respond_to do |format|

      if @product.save

UPDATE "products" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Eyeshadow pallets, Illuminator, Gloss, Brushes"], ["description", "Eyeshadow pallets, Illuminator, Gloss, Brushes sets."], ["updated_at", "2019-09-24 13:31:37.216463"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_product
    product_id = params[:id]
    product_cache = $redis.get("product:#{product_id}")

    if product_cache
      puts 'Loaded product from cache'
      @product = Marshal.load(product_cache)
    else
      puts 'Loaded product from database'
      @product = Product.find(product_id)