app/controllers/users_controller.rb

  def update
    respond_to do |format|
     if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Emre"], ["last_name", "Aytekin"], ["updated_at", "2019-09-06 06:21:02.157510"], ["id", 1]]