app/views/products/show.html.erb

      <p>Average Rating: <div id="average-rating" class="rated" data-score="<%= @product.average_rating %>"></div> </p>
        <% if @product.comments.exists? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC  [["product_id", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."product_id" = ? LIMIT ?  [["product_id", 1], ["LIMIT", 1]]